Autodesk.Navisworks.Api.CameraMode
Describes the relationship of camera to viewer.

Autodesk.Navisworks.Api.CameraMode.FirstPerson
First person mode.

Autodesk.Navisworks.Api.CameraMode.ThirdPerson
Third person mode.